ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/Periph_Driver/src/tmpm066_i2c.c
    /* Set I2CxCR2<MST>, <TRX>, <PIN> and clear <BB> to generate stop condition */
    I2Cx->CR2 = I2CCR2_STOP_CONDITION | I2CCR2_I2CM_I2C;
}

/**
  * @brief  Get the I2C channel state in I2C mode
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval The state of the I2C channel in I2C bus.
  */
I2C_State I2C_GetState(TSB_I2C_TypeDef *I2Cx)
{
    I2C_State state;
    state.All = 0U;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    state.All = I2Cx->SR;
    state.All &= I2C_DATA_MASK;
    return state;
}


/**
  * @brief  Set data to be sent and MCU starts transmission.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  Data: The data to be sent, max 0xFF.
  * @retval None
  */
void I2C_SetSendData(TSB_I2C_TypeDef *I2Cx, uint32_t Data)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_I2C_DATA(Data));

    /* Write data into I2CxDBR */
    I2Cx->DBR = Data;
}

/**
  * @brief  Get data having been received.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval The data having been received
  */
uint32_t I2C_GetReceiveData(TSB_I2C_TypeDef *I2Cx)
{
    uint32_t retval = 0U;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    /* Save the received data */
    retval = I2Cx->DBR;
    retval &= I2C_DATA_MASK;

    return retval;
}

/**
  * @brief  Enable or disable I2C free data mode of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: New state of free data mode.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetFreeDataMode(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxI2CAR<ALS> to use free data mode transfer in I2C mode */
        I2Cx->AR |= I2CAR_ALS_SET;
    } else {
        /* Clear I2CxI2CAR<ALS> to not use free data mode transfer in I2C mode */
        I2Cx->AR &= I2CAR_ALS_CLEAR;
    }
}

/**
  * @brief  Get slave address match detection state.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval DISABLE or ENABLE.
  */
FunctionalState I2C_GetSlaveAddrMatchState(TSB_I2C_TypeDef *I2Cx)
{
    uint32_t tmp = 0U;
    FunctionalState retval = DISABLE;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    tmp = I2Cx->CR1 & I2CCR1_NOACK_MASK;
    if (tmp == I2CCR1_NOACK_ENABLE) {
        /* the slave address match or general call detection are enabled. */
        retval = ENABLE;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Set prescaler clock of the specified I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  PrescalerClock: the prescaler clock value.
  *   This parameter can be one of the following values:
  *   I2C_PRESCALER_DIV_1 to I2C_PRESCALER_DIV_32
  * @retval None
  */
void I2C_SetPrescalerClock(TSB_I2C_TypeDef *I2Cx, uint32_t PrescalerClock)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    /* Get the system clock frequency */
    SystemCoreClockUpdate();

    /* Check the prescaler clock in the range between 50ns and 150ns */
    assert_param(IS_PRESCALER_CLK_VALID(PrescalerClock, SystemCoreClock));

    /* Write prescaler clock into I2CxPRS<PRSCK> */
    I2Cx->PRS = PrescalerClock % I2C_PRESCALER_DIV_32;
}

/**
  * @brief  Enable or disable open condition of the pin.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: Specify I2C interrupt setting.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetSELPINCDReq(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxIE<SELPINCD> to enable pin open by reading DBR */
        I2Cx->IE |= I2CIE_IE_SELPINCD_SET;
    } else {
        /* Clear I2CxIE<SELPINCD> to disable pin open by reading DBR */
        I2Cx->IE &= I2CIE_IE_SELPINCD_CLEAR;
    }
}


/**
  * @brief  Enable or disable a DMAC transmisstion request output.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: Specify I2C interrupt setting.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetDMARI2CTXReq(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxIE<DMARI2CTX> to enable a DMAC transmisstion request */
        I2Cx->IE |= I2CIE_IE_DMARI2CTX_SET;
    } else {
        /* Clear I2CxIE<DMARI2CTX> to disable a DMAC transmisstion request */
        I2Cx->IE &= I2CIE_IE_DMARI2CTX_CLEAR;
    }
}

/**
  * @brief  Enable or disable a DMAC reception request output.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: Specify I2C interrupt setting.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetDMARI2CRXReq(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxIE<DMARI2CRX> to enable a DMAC reception request */
        I2Cx->IE |= I2CIE_IE_DMARI2CRX_SET;
    } else {
        /* Clear I2CxIE<DMARI2CRX> to disable a DMAC reception request */
        I2Cx->IE &= I2CIE_IE_DMARI2CRX_CLEAR;
    }
}

/**
  * @brief  Enable or disable NACK detection interrupt of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: Specify I2C interrupt setting.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetINTNACKReq(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxIE<INTNACK> to enable NACK detection interrupt */
        I2Cx->IE |= I2CIE_IE_INTNACK_SET;
    } else {
        /* Clear I2CxIE<INTNACK> to disable NACK detection interrupt */
        I2Cx->IE &= I2CIE_IE_INTNACK_CLEAR;
    }
}

/**
  * @brief  Enable or disable bus-free interrupt of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: Specify I2C interrupt setting.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetINTI2CBFReq(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxIE<INTNACK> to enable bus-free interrupt */
        I2Cx->IE |= I2CIE_IE_INTI2CBF_SET;
    } else {
        /* Clear I2CxIE<INTNACK> to disable bus-free interrupt */
        I2Cx->IE &= I2CIE_IE_INTI2CBF_CLEAR;
    }
}

/**
  * @brief  Enable or disable AL interrupt of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: Specify I2C interrupt setting.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetINTI2CALReq(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxIE<INTNACK> to enable AL interrupt */
        I2Cx->IE |= I2CIE_IE_INTI2CAL_SET;
    } else {
        /* Clear I2CxIE<INTNACK> to disable AL interrupt */
        I2Cx->IE &= I2CIE_IE_INTI2CAL_CLEAR;
    }
}

/**
  * @brief  Enable or disable I2C interrupt request of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: Specify I2C interrupt setting.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetINTI2CReq(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxIE<IE> to enable I2C interrupt request */
        I2Cx->IE |= I2CIE_IE_INTI2C_SET;
    } else {
        /* Clear I2CxIE<IE> to disable I2C interrupt request */
        I2Cx->IE &= I2CIE_IE_NTI2C_CLEAR;
    }
}

/**
  * @brief  Get NACK interrupt generation state.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval DISABLE or ENABLE.
  */
FunctionalState I2C_GetNACKStatus(TSB_I2C_TypeDef *I2Cx)
{
    uint32_t tmp = 0U;
    FunctionalState retval = DISABLE;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    tmp = I2Cx->ST & I2CST_NACK_MASK;
    if (tmp == I2CST_NACK_SET) {
        /* the NACK interrupt has been generated */
        retval = ENABLE;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Get I2CBF interrupt generation state.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval DISABLE or ENABLE.
  */
FunctionalState I2C_GetINTI2CBFStatus(TSB_I2C_TypeDef *I2Cx)
{
    uint32_t tmp = 0U;
    FunctionalState retval = DISABLE;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    tmp = I2Cx->ST & I2CST_I2CBF_MASK;
    if (tmp == I2CST_I2CBF_SET) {
        /* the I2CBF interrupt has been generated */
        retval = ENABLE;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Get I2CAL interrupt generation state.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval DISABLE or ENABLE.
  */
FunctionalState I2C_GetINTI2CALStatus(TSB_I2C_TypeDef *I2Cx)
{
    uint32_t tmp = 0U;
    FunctionalState retval = DISABLE;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

