ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM066/Periph_Driver/src/tmpm066_i2c.c
    tmp = I2Cx->ST & I2CST_I2CAL_MASK;
    if (tmp == I2CST_I2CAL_SET) {
        /* the I2CAL interrupt has been generated */
        retval = ENABLE;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Get I2C interrupt generation state.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval DISABLE or ENABLE.
  */
FunctionalState I2C_GetINTI2CStatus(TSB_I2C_TypeDef *I2Cx)
{
    uint32_t tmp = 0U;
    FunctionalState retval = DISABLE;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    tmp = I2Cx->ST & I2CST_I2C_MASK;
    if (tmp == I2CST_I2C_SET) {
        /* the I2C interrupt has been generated */
        retval = ENABLE;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Clear the NACK interrupt output.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval None
  */
void I2C_ClearINTNACKOutput(TSB_I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    /* Set I2CxST<NACK> to clear the NACK interrupt output(INTI2Cx) */
    I2Cx->ST = I2CST_NACK_SET;
}

/**
  * @brief  Clear the I2CBF interrupt output.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval None
  */
void I2C_ClearINTI2CBFOutput(TSB_I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    /* Set I2CxST<I2CBF> to clear the I2CBF interrupt output(INTI2Cx) */
    I2Cx->ST = I2CST_I2CBF_SET;
}

/**
  * @brief  Clear the I2CAL interrupt output.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval None
  */
void I2C_ClearINTI2CALOutput(TSB_I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    /* Set I2CxST<I2CAL> to clear the I2CAL interrupt output(INTI2Cx) */
    I2Cx->ST = I2CST_I2CAL_SET;
}

/**
  * @brief  Clear the I2C interrupt output.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval None
  */
void I2C_ClearINTOutput(TSB_I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    /* Set I2CxST<I2C> to clear the I2C interrupt output(INTI2Cx) */
    I2Cx->ST = I2CST_I2C_SET;
}

/**
  * @brief  Enable or disable general-call detection.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: New state of general call detection.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetGeneralCall(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = I2Cx->OP;
    if (NewState == ENABLE) {
        /* Clear I2CxOP<GCDI>, general-call detection is ON */
        tmp &= I2COP_GCDI_ON;
    } else {
        /* Set I2CxOP<GCDI>, general-call detection is OFF */
        tmp |= I2COP_GCDI_OFF;
    }
    I2Cx->OP = tmp;

}

/**
  * @brief Detect or not a repeated start of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: New state of free data mode.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_DetectRepeatStart(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxI2COP<RSTA> to detect a repeated start */
        I2Cx->OP |= I2COP_RSTA_SET;
    } else {
        /* Clear I2CxI2COP<RSTA> to not detect a repeated start */
        I2Cx->OP &= I2COP_RSTA_CLEAR;
    }
}

/**
  * @brief  Get repeated start detection state.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval DISABLE or ENABLE.
  */
FunctionalState I2C_GetRepeatStartDetState(TSB_I2C_TypeDef *I2Cx)
{
    uint32_t tmp = 0U;
    FunctionalState retval = DISABLE;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    tmp = I2Cx->OP & I2COP_RSTA_SET;
    if (tmp == I2COP_RSTA_SET) {
        /* the repeated start detection are enabled. */
        retval = ENABLE;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief Select an ACK output of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: New state of free data mode.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SelectACKoutput(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxI2COP<MFACK> to select NACK output */
        I2Cx->OP |= I2COP_MFACK_NACK;
    } else {
        /* Clear I2CxI2COP<MFACK> to select ACK output */
        I2Cx->OP &= I2COP_MFACK_ACK;
    }
}

/**
  * @brief  Enable or disable repeat start of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: New state of free data mode.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_SetRepeatStart(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxI2COP<SREN> to enable repeat start output */
        I2Cx->OP |= I2COP_SREN_SET;
    } else {
        /* Clear I2CxI2COP<SREN> to disable repeat start output */
        I2Cx->OP &= I2COP_SREN_CLEAR;
    }
}

/**
  * @brief  Get repeated start state.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @retval BUSY or DONE.
  */
WorkState I2C_GetRepeatStartState(TSB_I2C_TypeDef *I2Cx)
{
    uint32_t tmp = 0U;
    WorkState retval = BUSY;

    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));

    tmp = I2Cx->OP & I2COP_SREN_SET;
    if (tmp == I2COP_SREN_SET) {
        /* the repeated start detection has completed. */
        retval = DONE;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Enable or disable using 2nd slave address of the I2C channel.
  * @param  I2Cx: Select the I2C channel.
  *   This parameter can be one of the following values:
  *   TSB_I2C0,TSB_I2C1
  * @param  NewState: New state of free data mode.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void I2C_Set2ndSlaveAddress(TSB_I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set I2CxI2CAR2<SA2EN> to using 2nd slave address */
        I2Cx->AR2 |= I2CAR2_SA2EN_USE;
    } else {
        /* Clear I2CxI2CAR2<SA2EN> to not using 2nd slave address */
        I2Cx->AR2 &= I2CAR2_SA2EN_NOUSE;
    }
}

/** @} */
/* End of group I2C_Exported_Functions */

/** @} */
/* End of group I2C */

/** @} */
/* End of group TX00_Periph_Driver */

#endif                          /*   defined(__TMPM066_I2C_H) */
